#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.private_key: Refreshing state... [id=9a12f9b8e1d5f4d6b6c02dfd39eb221f98994d0e]
linode_nodebalancer.app_nb: Refreshing state... [id=187443]
acme_registration.reg: Refreshing state... [id=https://acme-staging-v02.api.letsencrypt.org/acme/acct/38906778]
linode_instance.app[0]: Refreshing state... [id=33349674]
linode_domain.domain: Refreshing state... [id=1770697]
linode_instance.db: Refreshing state... [id=33349677]
linode_domain_record.rewards: Refreshing state... [id=19849590]
acme_certificate.certificate: Refreshing state... [id=81422f52-55a8-69fa-6478-d3ad54e175ad]
linode_nodebalancer_config.app_nb_config: Refreshing state... [id=267288]
linode_nodebalancer_node.app_nb_node[0]: Refreshing state... [id=38069202]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # acme_registration.reg has been deleted
  - resource "acme_registration" "reg" {
      - account_key_pem  = (sensitive value)
      - email_address    = "linode@dangerous.tech" -> null
      - id               = "https://acme-staging-v02.api.letsencrypt.org/acme/acct/38906778" -> null
      - registration_url = "https://acme-staging-v02.api.letsencrypt.org/acme/acct/38906778" -> null
    }

  # linode_domain.domain has been deleted
  - resource "linode_domain" "domain" {
      - domain      = "josh.services" -> null
      - expire_sec  = 0 -> null
      - id          = "1770697" -> null
      - master_ips  = [] -> null
      - refresh_sec = 0 -> null
      - retry_sec   = 0 -> null
      - soa_email   = "linode@dangerous.tech" -> null
      - status      = "active" -> null
      - tags        = [
          - "fealty",
        ] -> null
      - ttl_sec     = 30 -> null
      - type        = "master" -> null
    }

  # linode_domain_record.rewards has been deleted
  - resource "linode_domain_record" "rewards" {
      - domain_id   = 1770697 -> null
      - id          = "19849590" -> null
      - name        = "rewards" -> null
      - port        = 0 -> null
      - priority    = 0 -> null
      - record_type = "A" -> null
      - target      = "45.79.244.91" -> null
      - ttl_sec     = 30 -> null
      - weight      = 0 -> null
    }

  # linode_instance.app[0] has been deleted
  - resource "linode_instance" "app" {
      - authorized_users   = [
          - "linodeDT",
        ] -> null
      - backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> null
      - backups_enabled    = true -> null
      - boot_config_label  = "My fealty-app Profile" -> null
      - id                 = "33349674" -> null
      - image              = "private/15094791" -> null
      - ip_address         = "170.187.148.179" -> null
      - ipv4               = [
          - "170.187.148.179",
          - "192.168.141.30",
        ] -> null
      - ipv6               = "2600:3c02::f03c:92ff:fea4:b6f7/128" -> null
      - label              = "fealty-app-1" -> null
      - private_ip         = true -> null
      - private_ip_address = "192.168.141.30" -> null
      - region             = "us-southeast" -> null
      - specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> null
      - status             = "running" -> null
      - swap_size          = 512 -> null
      - tags               = [
          - "fealty",
        ] -> null
      - type               = "g6-nanode-1" -> null
      - watchdog_enabled   = true -> null

      - alerts {
          - cpu            = 90 -> null
          - io             = 10000 -> null
          - network_in     = 10 -> null
          - network_out    = 10 -> null
          - transfer_quota = 80 -> null
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-app Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67166743 -> null
                  - disk_label = "fealty-app" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67166744 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - purpose = "public" -> null
            }
          - interface {
              - ipam_address = "10.10.10.2/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67166743 -> null
          - label            = "fealty-app" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67166744 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      - interface {
          - purpose = "public" -> null
        }
      - interface {
          - ipam_address = "10.10.10.2/24" -> null
          - label        = "fealty-vlan" -> null
          - purpose      = "vlan" -> null
        }
    }

  # linode_instance.db has been deleted
  - resource "linode_instance" "db" {
      - authorized_users  = [
          - "linodeDT",
        ] -> null
      - backups           = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> null
      - backups_enabled   = true -> null
      - boot_config_label = "My fealty-db Profile" -> null
      - id                = "33349677" -> null
      - image             = "private/15094788" -> null
      - ip_address        = "170.187.148.194" -> null
      - ipv4              = [
          - "170.187.148.194",
        ] -> null
      - ipv6              = "2600:3c02::f03c:92ff:fea4:b6ae/128" -> null
      - label             = "fealty-db" -> null
      - private_ip        = false -> null
      - region            = "us-southeast" -> null
      - specs             = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> null
      - status            = "running" -> null
      - swap_size         = 512 -> null
      - tags              = [
          - "fealty",
        ] -> null
      - type              = "g6-nanode-1" -> null
      - watchdog_enabled  = true -> null

      - alerts {
          - cpu            = 90 -> null
          - io             = 10000 -> null
          - network_in     = 10 -> null
          - network_out    = 10 -> null
          - transfer_quota = 80 -> null
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-db Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67166749 -> null
                  - disk_label = "fealty-db" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67166750 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.3/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67166749 -> null
          - label            = "fealty-db" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67166750 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      - interface {
          - ipam_address = "10.10.10.3/24" -> null
          - label        = "fealty-vlan" -> null
          - purpose      = "vlan" -> null
        }
    }

  # linode_nodebalancer.app_nb has been deleted
  - resource "linode_nodebalancer" "app_nb" {
      - client_conn_throttle = 20 -> null
      - created              = "2021-12-31T16:18:45Z" -> null
      - hostname             = "45-79-244-91.ip.linodeusercontent.com" -> null
      - id                   = "187443" -> null
      - ipv4                 = "45.79.244.91" -> null
      - ipv6                 = "2600:3c02:1::2d4f:f45b" -> null
      - label                = "fealty-nodebalancer" -> null
      - region               = "us-southeast" -> null
      - tags                 = [
          - "fealty",
        ] -> null
      - transfer             = [
          - {
              - in    = 0
              - out   = 0
              - total = 0
            },
        ] -> null
      - updated              = "2021-12-31T16:18:45Z" -> null
    }

  # linode_nodebalancer_config.app_nb_config has been deleted
  - resource "linode_nodebalancer_config" "app_nb_config" {
      - algorithm       = "leastconn" -> null
      - check           = "http" -> null
      - check_attempts  = 3 -> null
      - check_body      = "" -> null
      - check_interval  = 30 -> null
      - check_passive   = true -> null
      - check_path      = "/healthz" -> null
      - check_timeout   = 5 -> null
      - cipher_suite    = "recommended" -> null
      - id              = "267288" -> null
      - node_status     = [
          - {
              - down = 0
              - up   = 0
            },
        ] -> null
      - nodebalancer_id = 187443 -> null
      - port            = 443 -> null
      - protocol        = "https" -> null
      - proxy_protocol  = "none" -> null
      - ssl_cert        = (sensitive value)
      - ssl_commonname  = "rewards.josh.services" -> null
      - ssl_fingerprint = "F5:5A:63:FF:1C:B5:4D:EF:A5:91:67:12:69:E8:65:C9:06:4E:9B:FB" -> null
      - ssl_key         = (sensitive value)
      - stickiness      = "http_cookie" -> null
    }

  # linode_nodebalancer_node.app_nb_node[0] has been deleted
  - resource "linode_nodebalancer_node" "app_nb_node" {
      - address         = "192.168.141.30:3000" -> null
      - config_id       = 267288 -> null
      - id              = "38069202" -> null
      - label           = "app-node-1" -> null
      - mode            = "accept" -> null
      - nodebalancer_id = 187443 -> null
      - status          = "Unknown" -> null
      - weight          = 50 -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # acme_registration.reg will be created
  + resource "acme_registration" "reg" {
      + account_key_pem  = (sensitive value)
      + email_address    = "linode@dangerous.tech"
      + id               = (known after apply)
      + registration_url = (known after apply)
    }

  # linode_domain.domain will be created
  + resource "linode_domain" "domain" {
      + domain    = "josh.services"
      + id        = (known after apply)
      + soa_email = "linode@dangerous.tech"
      + status    = (known after apply)
      + tags      = [
          + "fealty",
        ]
      + ttl_sec   = 30
      + type      = "master"
    }

  # linode_domain_record.rewards will be created
  + resource "linode_domain_record" "rewards" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "rewards"
      + record_type = "A"
      + target      = (known after apply)
      + ttl_sec     = 30
    }

  # linode_firewall.fealty_fw[0] will be created
  + resource "linode_firewall" "fealty_fw" {
      + devices         = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + inbound_policy  = "DROP"
      + label           = "fealty-fw"
      + linodes         = (known after apply)
      + outbound_policy = "ACCEPT"
      + status          = (known after apply)
      + tags            = [
          + "fealty",
        ]

      + inbound {
          + action   = "DROP"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "drop-inbound-tcp"
          + protocol = "TCP"
        }
      + inbound {
          + action   = "DROP"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "drop-inbound-udp"
          + protocol = "UDP"
        }
      + inbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "allow-inbound-icmp"
          + protocol = "ICMP"
        }

      + outbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "allow-https"
          + ports    = "443"
          + protocol = "TCP"
        }
    }

  # linode_instance.app[0] will be created
  + resource "linode_instance" "app" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = false
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty-app-1"
      + private_ip         = true
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + purpose = "public"
        }
      + interface {
          + ipam_address = "10.10.10.2/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

  # linode_instance.db will be created
  + resource "linode_instance" "db" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty-db"
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + ipam_address = "10.10.10.3/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

  # linode_nodebalancer.app_nb will be created
  + resource "linode_nodebalancer" "app_nb" {
      + client_conn_throttle = 20
      + created              = (known after apply)
      + hostname             = (known after apply)
      + id                   = (known after apply)
      + ipv4                 = (known after apply)
      + ipv6                 = (known after apply)
      + label                = "fealty-nodebalancer"
      + region               = "us-southeast"
      + tags                 = [
          + "fealty",
        ]
      + transfer             = (known after apply)
      + updated              = (known after apply)
    }

  # linode_nodebalancer_config.app_nb_config will be created
  + resource "linode_nodebalancer_config" "app_nb_config" {
      + algorithm       = "leastconn"
      + check           = "http"
      + check_attempts  = 3
      + check_body      = (known after apply)
      + check_interval  = 30
      + check_passive   = (known after apply)
      + check_path      = "/healthz"
      + check_timeout   = 5
      + cipher_suite    = "recommended"
      + id              = (known after apply)
      + node_status     = (known after apply)
      + nodebalancer_id = (known after apply)
      + port            = 443
      + protocol        = "https"
      + proxy_protocol  = "none"
      + ssl_cert        = (sensitive value)
      + ssl_commonname  = (known after apply)
      + ssl_fingerprint = (known after apply)
      + ssl_key         = (sensitive value)
      + stickiness      = "http_cookie"
    }

  # linode_nodebalancer_node.app_nb_node[0] will be created
  + resource "linode_nodebalancer_node" "app_nb_node" {
      + address         = (known after apply)
      + config_id       = (known after apply)
      + id              = (known after apply)
      + label           = "app-node-1"
      + mode            = "accept"
      + nodebalancer_id = (known after apply)
      + status          = (known after apply)
      + weight          = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ DB_Private_IP         = [
      - "10.10.10.3/24",
    ]
  ~ Domain_IP             = "45.79.244.91" -> (known after apply)
  ~ NodeBalancer_Hostname = "45-79-244-91.ip.linodeusercontent.com" -> (known after apply)
  ~ NodeBalancer_IPv4     = "45.79.244.91" -> (known after apply)
  ~ NodeBalancer_IPv6     = "2600:3c02:1::2d4f:f45b" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*